Samat1989/smartvend-tablet/firmware/esp-screen/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 МБ флеша, своя таблица разделов (см. partitions.csv).
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# S3R8: 8 МБ PSRAM по octal-шине. Буферы LVGL и кэш каталога живут здесь —
# внутренней памяти не хватит ровно в момент оплаты, когда TLS-handshake
# просит ~40 КБ кучи (docs/esp-screen-micromarket.md §2).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Консоль по родному USB-JTAG (/dev/ttyACM0): у платы нет отдельного
# USB-UART-моста, и лог иначе просто некуда отдать.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# QR рисуем сами на экране: покупатель сканирует его телефоном, ссылку даёт
# create-payment. Виджет входит в LVGL, отдельная библиотека не нужна.
CONFIG_LV_USE_QRCODE=y

# Сторожевой таймер. Внешнего супервизора на этой плате нет, поэтому полагаемся
# на встроенный: пятнадцать секунд без признаков жизни — перезагрузка.
# Панику включаем сознательно: зависший автомат на точке чинить некому, а
# перезагрузка возвращает его в строй сама. Пятнадцать, а не пять, потому что
# рядом живут HTTP-вызовы с таймаутом в двадцать пять секунд — они выполняются
# в своих задачах и под наблюдение не берутся.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_TASK_WDT_PANIC=y
